baza={"01011110000000101110001":"Бабаев", "01101100111110101110010":"Шестаков", "10111011111000000000011":"Боженко", "01100111110000101110000":"Шишминцев", "01111111111110111100010":"Затикян", "10100111010000000000011":"Шаллиева",
      "01011000010111100010110":"Смирнов", "01100100100101101001010":"Абдулов", "11100110000101000010001":"Кремпольская", "10011111011110100110011":"Касьяненко",
      "00000111010000101010001":"Язев", "00000110101110101000110":"Алексеев", "01001110000101100011111":"Горлов", "10000110001111000010100":"Садовая", "11101111010100000010001":"Надери",
      "01001101101110101111010":"Оншин", "11100001100110001110000":"Петрова", "01111100111001111001111":"Кабдулвахитов", "10101010010101100101000":"Авокадо", "01000001110001101001010":"Царёв",
      "11000111100101001100010":"Адрат", "01001110111100010001100":"Комелин", "01100010101100101100010":"Миляев",
      "01011100000101101000100":"Телунц", "01010110111100000001101":"Белисов", "00100111110001011011011":"Конопля" }
klu=""
print("Это девушка?")
m=input()
if m=="y":
    klu+="1"
elif m=="n":
    klu+="0"
print("18 лет?")
m=input()
if m=="y":
    klu+="1"
elif m=="n":
    klu+="0"
print("Носит очки?")
m=input()
if m=="y":
    klu+="1"
elif m=="n":
    klu+="0"
print("Карие глаза?")
m=input()
if m=="y":
    klu+="1"
elif m=="n":
    klu+="0"
print("Темные волосы?")
m=input()
if m=="y":
    klu+="1"
elif m=="n":
    klu+="0"
print("Есть братья или сёстры?")
m=input()
if m=="y":
    klu+="1"
elif m=="n":
    klu+="0"
print("Есть домашние животные?")
m=input()
if m=="y":
    klu+="1"
elif m=="n":
    klu+="0"
print("Из Петербурга?")
m=input()
if m=="y":
    klu+="1"
elif m=="n":
    klu+="0"
print("Есть IPhone?")
m=input()
if m=="y":
    klu+="1"
elif m=="n":
    klu+="0"
print("Практику по линалу ведёт Тушавин?")
m=input()
if m=="y":
    klu+="1"
elif m=="n":
    klu+="0"
print("Нравится больше кофе, чем чай?")
m=input()
if m=="y":
    klu+="1"
elif m=="n":
    klu+="0"
print("Любит больше домашнюю еду, чем фастфуд?")
m=input()
if m=="y":
    klu+="1"
elif m=="n":
    klu+="0"
print("Носит часы?")
m=input()
if m=="y":
    klu+="1"
elif m=="n":
    klu+="0"
print("Полное имя начинается с гласной?")
m=input()
if m=="y":
    klu+="1"
elif m=="n":
    klu+="0"
print("Любит больше пиццу, чем суши?")
m=input()
if m=="y":
    klu+="1"
elif m=="n":
    klu+="0"
print("Курит?")
m=input()
if m=="y":
    klu+="1"
elif m=="n":
    klu+="0"
print("Рост выше 175?")
m=input()
if m=="y":
    klu+="1"
elif m=="n":
    klu+="0"
print("Есть вторая половинка?")
m=input()
if m=="y":
    klu+="1"
elif m=="n":
    klu+="0"
print("День рождения зимой или летом?")
m=input()
if m=="y":
    klu+="1"
elif m=="n":
    klu+="0"
print("Играет в кс или доту?")
m=input()
if m=="y":
    klu+="1"
elif m=="n":
    klu+="0"
print("Живёт в общежитии?")
m=input()
if m=="y":
    klu+="1"
elif m=="n":
    klu+="0"
print("Предпочитает больше фильмы, чем сериалы?")
m=input()
if m=="y":
    klu+="1"
elif m=="n":
    klu+="0"
print("Смотрит аниме?")
m=input()
if m=="y":
    klu+="1"
elif m=="n":
    klu+="0"

if klu in baza:
    print(baza[klu])
else:
    print("Ne sushestvuet")